
[X2DownloadableContentInfo_WOTC_SoldierConsoleCommands]

;  -- Localized Strings for Console Feedback Messages --
;  -----------------------------------------------------

strNoUnitSelected =	":>> 错误：未选择单位 - 请在士兵的军械库屏幕输入此命令。"
strClassNotFound = ":>> 错误：你确定了士兵职业，但 '<ClassName/>' 不存在。"
strIncorrectCharacterTemplate = ":>> 错误：你确定了士兵职业，但所选士兵不是 '<ClassName/>' 职业所需的角色模板（ClassTemplate）。"
strIncorrectRankValue = ":>> 错误：输入的军衔/等级值无效。"
strCantRespecRookie = ":>> 错误：无法重建新兵 - 单位等级提升 或 指定一个职业。"
strInvalidCombatInt = ":>> 错误：输入的战斗智商值无效。"
strInvalidEStat = ":>> 错误：输入的属性类别无效。"
strInvalidValue = ":>> 错误：输入的值无效。"
strNoValidUnit = ":>> 错误：未选择有效单位。"

strCappingRank = ":>> 注意：请求的等级超过最高等级 - 最高等级上限。"

strXPSet = ":>> 成功：单位经验成功设置为<XPValue/>。"
strRankSet = ":>> 成功：单位等级成功设置为<RankLevel/>。"
strStatSet = ":>> 成功：单位属性值 '<StatType/>' 已成功设置。新值 '<StatValue/>'"
strClassSet = ":>> 成功：士兵职业成功设置为 '<ClassName/>' 职业。"
strComIntSet = ":>> 成功：士兵战斗智商成功设置为 '<RankLevel/>' 。"
strWeaponReloaded = ":>> 成功：所选单位的主武器重新装弹。"